{
    "experience": {
        "title": "Work Experience",
        "content": {
            "asa": {
                "title": "Application Security Analyst",
                "text": "Adani Groups, Ahmedabad, Gujarat | Sep 2022 - Mar 2023\n- Identified potential threats in the application architecture and proposed solutions to mitigate risks.\n- Collaborated with development teams to implement security fixes.\n- Worked on incident response and forensics investigations.\n- Conducted regular security assessments and vulnerability scans.\n- Provided training and awareness sessions to development teams.\n- Monitored security tools and systems to detect and respond to incidents.\n- Assisted in developing security policies and procedures.\n- Analyzed security breaches to identify root causes and recommended corrective actions."
            },
            "vapt": {
                "title": "Vulnerability Assessment and Penetration Tester",
                "text": "TechDefence Labs Pvt. Ltd., Ahmedabad, Gujarat | Aug 2022 - Jul 2023\n- Performed vulnerability assessments on various networks, systems, and applications.\n- Documented findings in detailed report format.\n- Provided recommendations for remediation and risk mitigation.\n- Conducted penetration testing to identify security weaknesses.\n- Assisted clients in implementing security controls and measures.\n- Presented assessment findings to clients and stakeholders.\n- Conducted security audits and compliance assessments.\n- Developed and maintained security testing methodologies."
            }, 
            "SAI" : {
                "title": "Security Analyst Intern",
                "text": "TechDefence Labs Pvt. Ltd., Ahmedabad, Gujarat | Aug 2022 - Jul 2023\n- Worked on multiple VAPT assessments including web, mobile, infrastructure and thick client applications.\nIdentified, analysed vulnerabilities and provided solutions to problems.\n- Created plans and communicated deadlines to complete projects on time\n- Wrote custom burp extensions according to the assessment needs\n -Managed Client interactions throughout the project. "
            }
        }
    },
    "skills": {
        "title": "Skills",
        "content": {
            "Skills": {
                "title": "Skills",
                "text": "BurpSuite, Nessus, Nmap, Wireshark, Java, Python, Linux, Bash, PowerShell, Metasploit, SQL, Web Application Security, Network Security, Penetration Testing, Vulnerability Assessment, Security Auditing, Incident Response, Forensics"
            }
        }
    },
    "aboutMe": {
        "title": "Details",
        "content": {
            "contact": {
                "title": "Contact",
                "text": "<b> LinkedIn | Github "
            }
        }
    },
    "education": {
        "title": "Education",
        "content": {
            "Con": {
                "title": "Master of Engineering in Information Systems Security",
                "text": "Concordia University, Montreal, Quebec | Jan 2023 - Present"
            },
            "SOU": {
                "title": "Bachelor of Engineering",
                "text": "Silver Oak College of Engineering and Technology, Gujarat Technological University, Ahmedabad, Gujarat | Aug 2017 - Jun 2021"
            }
        }
    },
    "certifications": {
        "title": "Certifications",
        "content": {
            "CC": {
                "title": "Certified In CyberSecurity by ISC2",
                "text": "ID: 1122911"
            },
            "RHCE": {
                "title": "Red Hat Certified Engineer certification",
                "text": "ID: 190-339-002"
            },
            "RHCSA": {
                "title": "Red Hat Certified System Administrator certification",
                "text": "ID: 190-339-002"
            },
            "ACE": {
                "title": "Google Cloud Certified Associate Cloud Engineer,",
                "text": "ID: MpiZZ8"
            }
        }
    },
    "projects": {
        "title": "Projects",
        "content": {
            "SOE": {
                "title": "Silver Oak Edge",
                "text": ": It's a quiz app for institutes that uses multiple-choice questions to help students study their academics. I worked on the UI/UX and deployment to power up this App while my colleagues worked on the programming and API. This app helped to enrich the learning of more than 1500 students"
            },
            "DA": {
                "title": "Department App",
                "text": "It's an LMS system for departments to improve better connectivity between students and faculties. This was focused to digitalize the day-to-day communications and results shared between management and students. This  application was planned to simplify the daily task of more than 1000 students."
            },
            "PA": {
                "title": "Pentest Automation",
                "text": "An API based pentest automation tool in the making use of multiple tools such as Nmap, dnsdumpster, sqlmap, dalfonXSS, etc in backend to perform the required enumeration task and exploitation."
            },
            "ARG": {
                "title": "Automatic Report Generator ",
                "text": "A python-based tool which helps in generating VA and PT reports after the assessments have been completed. A completely flexible tool which takes the help of Jinja Templates to create user-defined reports"
            }
        }
    },
    "talks": {
        "title": "Talks",
        "content": {
            "MAD": {
                "title": "Mobile App Development for Android",
                "text": "5 Days workshop on basic of Android App Development"
            },
            "D101": {
                "title": "Deserialization 101",
                "text": " A talk on Deserialization vulnerability in OWASP Ahmedabad Chapter - June 2023"
            }
        }
    },
    "volunteer": {
        "title": "Volunteer",
        "content": {
            "CTF": {
                "title": "CTF Designer - AtHackCTF - Concordia University",
                "text": "Developed a web based CTF which utilized weakness in JWT , misconfiguration in application and Linux systems, SSRF, buffer overflow bypassing ASLR, NX, and PIE, misconfigured user permission, wrapping in docker containers."
            },
            "PS-OW": {
                "title": "Professional Speaker - OWASP Ahmedabad",
                "text": "This talk was focused on how a Deserialization vulnerability exists, the working mechanism behind it, root cause, searching for vulnerability and exploitation"
            },
            "SA-RHA": {
                "title": "Student Ambassador - RedHat Academy",
                "text": "Gained experience in public speaking through leading workshops and presentations for new students.Conducted new student orientations to facilitate retention and foster positive attitude towards attending university."
            },
            "ABM": {
                "title": "Advisory Board Member - IEEE SilverOak University",
                "text": "Analyzed data to identify areas of improvement in corporate governance policies and procedures. Provided guidance on ethical decision-making processes throughout the organization."
            },
            "TL": {
                "title": "Technical Lead - IEEE SilverOak University",
                "text": "Guided team through technical obstacles with expertise of system details.Investigated software issues by troubleshooting and analyzing systems. Provided technical guidance to team members on product design decisions, coding practices, testing methodologies, and debugging procedures. Prepared reports and correspondence concerned project specifications, activities and status."
            }
            
            
        }
    }
}
